[
    {
        "title": "Chicken Parmesan",
        "image_url": "/static/images/chicken-parmesan.jpg",
        "ingredients": [
            "2 boneless, skinless chicken breasts",
            "1 cup breadcrumbs",
            "½ cup grated Parmesan cheese",
            "1 cup marinara sauce",
            "1 cup shredded mozzarella cheese",
            "2 eggs, beaten",
            "1 tsp dried oregano",
            "1 tsp garlic powder",
            "Salt and pepper to taste",
            "Olive oil for frying"
        ],
        "optional_ingredients": [
            "Fresh basil for garnish"
        ],
        "instructions": [
            "Preheat the oven to 375°F (190°C).",
            "Season the chicken breasts with salt, pepper, oregano, and garlic powder.",
            "Dip each chicken breast in beaten eggs, then coat with a mixture of breadcrumbs and Parmesan cheese.",
            "In a skillet, heat olive oil over medium heat and fry the chicken until golden brown on both sides.",
            "Transfer the fried chicken to a baking dish. Top each breast with marinara sauce and shredded mozzarella cheese.",
            "Bake in the preheated oven for about 20 minutes, or until the cheese is bubbly and golden.",
            "Garnish with fresh basil if desired and serve hot."
        ],
        "serving_size": "2",
        "prep_time": "15 mins",
        "cook_time": "30 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_american": 1
    },
    {
        "title": "Shrimp with Broccoli in Garlic Sauce",
        "image_url": "/static/images/shrimp-with-broccoli-in-garlic-sauce.png",
        "ingredients": [
            "2 cups fresh broccoli florets",
            "1 tbsp water",
            "2 tbsps peanut oil",
            "4 large cloves garlic, minced",
            "1 cup low-sodium chicken broth",
            "1 tbsp soy sauce",
            "1 tbsp oyster sauce",
            "2 tsps grated fresh ginger root",
            "1 lb uncooked medium shrimp, peeled and deveined",
            "¼ cup canned water chestnuts, drained",
            "2 tbsps cornstarch"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Combine broccoli and water in a glass bowl; steam in microwave oven until slightly tender, 2 to 3 minutes.",
            "Heat peanut oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant, about 1 minute.",
            "Reduce heat to low. Add chicken broth, soy sauce, oyster sauce, and ginger root to the garlic; bring to a boil.",
            "Add shrimp; cook and stir until the shrimp turn pink, 3 to 4 minutes.",
            "Toss steamed broccoli and water chestnuts with shrimp mixture to coat with sauce.",
            "Stir cornstarch into mixture, 1 tbsp at a time, until sauce thickens, about 5 minutes."
        ],
        "serving_size": "4",
        "prep_time": "15 mins",
        "cook_time": "15 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_chinese": 1
    },
    {
        "title": "Bacon BBQ Cheeseburger",
        "image_url": "/static/images/bacon-bbq-cheeseburger.jpg",
        "ingredients": [
            "1 ½ lbs ground chuck 80-85% lean",
            "2 tbsps brown sugar",
            "1 tbsp chili powder",
            "2 tsps garlic powder",
            "1 tsp salt",
            "½ tsp black pepper",
            "1 tsp italian seasoning",
            "2 tsps Worchestire sauce"
        ],
        "optional_ingredients": [
            "4-8 slices cheddar cheese",
            "Sliced tomatoes",
            "French fried onions (or sliced red onions)",
            "Cooked bacon slices",
            "¼ cup BBQ sauce",
            "Lettuce",
            "4 burger buns"
        ],
        "instructions": [
            "In a large bowl, gently mix ground beef with seasonings and Worchestire sauce. Be careful not to overmix.",
            "Form 4 large patties with the ground beef and set to the side. Or you can make burger 'balls' to smash down onto a preheated griddle like we do in the video below.",
            "Preheat the grill to at least 400ºF. Once grill has preheated cook burgers 4-5 minutes per side, or until the internal temperature tests 165ºF.",
            "Once burgers are just about done, top burgers with 1-2 slices of cheese. Continue to cook to allow cheese to melt.",
            "To assemble burgers, add lettuce to the top of the bottom bun, then a burger, then tomato, onions, barbecue sauce, french fried onions and bacon.",
            "Place the bun on top of the burger and serve."
        ],
        "serving_size": "4",
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_american": 1
    },
    {
        "title": "Chicken Tikka Masala",
        "image_url": "/static/images/chicken-tikka-masala.jpg",
        "ingredients": [
            "1 cup yogurt",
            "1 tbsp lemon juice",
            "4 tsps ground cumin, divided",
            "1 tsp ground cinnamon",
            "2 tsps cayenne pepper",
            "2 tsps freshly ground black pepper",
            "1 tbsp minced fresh ginger",
            "2 tsps salt, divided, or more to taste",
            "3 boneless skinless chicken breasts, cut into bite-size pieces",
            "4 long skewers",
            "1 tbsp butter",
            "1 clove garlic, minced",
            "1 jalapeno pepper, finely chopped",
            "2 tsps paprika",
            "1 (8 oz) can tomato sauce",
            "1 cup heavy cream",
            "¼ cup chopped fresh cilantro"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Combine yogurt, lemon juice, 2 tsps cumin, cinnamon, cayenne, black pepper, ginger, and 1 tsp salt in a large bowl.",
            "Stir in chicken, cover, and refrigerate for 1 hour.",
            "Preheat a grill for high heat.",
            "Lightly oil the grill grate. Thread chicken onto skewers, and discard marinade.",
            "Grill until juices run clear, about 5 minutes on each side.",
            "Melt butter in a large heavy skillet over medium heat. Sauté garlic and jalapeño for 1 minute.",
            "Season with remaining 2 tsps cumin, paprika, and remaining 1 tsp salt. Stir in tomato sauce and cream. Simmer on low heat until sauce thickens, about 20 minutes.",
            "Add grilled chicken, and simmer for 10 minutes. Transfer to a serving platter, and garnish with fresh cilantro.",
            "Serve over rice."
        ],
        "serving_size": "4",
        "prep_time": "30 mins (plus marination)",
        "cook_time": "50 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_indian": 1
    },
    {
        "title": "Overnight Cinnamon Rolls",
        "image_url": "/static/images/overnight-cinnamon-rolls.png",
        "ingredients": [
            "1 cup milk",
            "½ cup butter",
            "0.25oz package active dry yeast",
            "½ cup white sugar",
            "4 ½ cups all-purpose flour",
            "1 tsp salt",
            "3 eggs",
            "¾ cup brown sugar",
            "1 tbsp ground cinnamon",
            "½ cup raisins",
            "1 tsp light corn syrup",
            "½ tsp vanilla extract",
            "1 ¼ cups sifted confectioners' sugar",
            "2 tbsps half-and-half cream"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Heat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter and stir until melted; let cool until lukewarm.",
            "In a large mixing bowl, dissolve the yeast in the milk mixture. Add the sugar, 3 cups of flour, salt and eggs; stir well to combine. Add the remaining flour, ½ cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.",
            "Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
            "Deflate the dough and turn it out onto a lightly floured surface and roll into a 10x 14 inch rectangle. Lightly brush the far edge with water. In a small bowl combine the cinnamon and ¾ cup brown sugar and sprinkle over the rectangles. Then sprinkle the raisins and chopped nuts over the dough. Roll up the dough into a log and seal the seam.",
            "Cut the dough into 12 equal pieces; place the pieces in a greased 9x13 inch baking pan, or 12 inch deep dish pizza pan. Cover with plastic wrap and place in the refrigerator to rise overnight.",
            "The next morning, preheat oven to 375°F (190°C). Take the rolls out of the refrigerator and let stand at room temperature for 30 minutes.",
            "Bake the rolls for 25 to 30 minutes or until golden. Meanwhile, combine the corn syrup with the vanilla in a small bowl. Whisk in the powdered sugar and enough cream to make a thick glaze; set aside. Drizzle the glaze over the rolls and serve warm."
        ],
        "serving_size": "12",
        "prep_time": "1 hr 20 mins",
        "cook_time": "30 mins",
        "is_breakfast": 1,
        "is_dessert": 1,
        "is_american": 1
    },
    {
        "title": "Italian Beef Sandwiches",
        "image_url": "/static/images/italian-beef-sandwiches.png",
        "ingredients": [
            "4 lbs boneless rump roast",
            "6 cloves garlic, slivered",
            "8 rolls of your choice",
            "1 cup water",
            "1 tbsp salt",
            "1 tbsp coarsely ground black pepper",
            "1 tbsp crushed red pepper",
            "1 tbsp dried oregano"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Preheat the oven to 250°F (120°C).",
            "Make slits in roast with a sharp knife, and insert garlic slivers. Place roast in a pan not much larger than the roast. Pour water into the pan, and season roast with salt, black pepper, red pepper, and oregano.",
            "Cover, and bake in the preheated oven for 2 hours, basting occasionally. Remove from oven, and let cool in roasting pan. Meat should be very rare. Wrap tightly and refrigerate overnight.",
            "The next day, remove roast from the pan, and slice as thinly as possible. Add a little water to the roasting pan, and heat on the stovetop, but do not boil. Stir to blend seasonings.",
            "When au jus is hot, add sliced beef just long enough to heat through.",
            "Serve on crusty Italian bread with au jus available for dipping."
        ],
        "serving_size": "8",
        "prep_time": "10 mins (plus 1 day to rest)",
        "cook_time": "2 hrs 20 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_italian": 1
    },
    {
        "title": "Slow Cooker Butter Chicken",
        "image_url": "/static/images/slow-cooker-butter-chicken.png",
        "ingredients": [
            "2 tbsps butter",
            "2 tbsps vegetable oil",
            "4 large skinless, boneless chicken thighs, cut into bite-sized pieces",
            "1 onion, diced",
            "3 cloves garlic, minced",
            "1 (6 oz) can tomato paste",
            "1 tbsp curry paste",
            "2 tsps curry powder",
            "2 tsps tandoori masala",
            "1 tsp garam masala",
            "15 green cardamom pods",
            "1 (14 oz) can coconut milk",
            "1 cup low-fat plain yogurt",
            "Salt to taste"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Heat butter and vegetable oil in a large skillet over medium heat. Stir in chicken, onion, and garlic. Cook and stir until onion has softened and turned translucent, about 10 minutes.",
            "Stir in tomato paste, curry paste, curry powder, tandoori masala, and garam masala until no lumps of tomato paste remain.",
            "Pour mixture into a slow cooker; stir in cardamom pods, coconut milk, and yogurt. Season with salt.",
            "Cook on High for 4 to 6 hours or Low for 6 to 8 hours, or until chicken is tender and sauce has reduced to the desired consistency.",
            "Remove and discard cardamom pods before serving. Serve with basmati rice and warm naan bread."
        ],
        "serving_size": "6",
        "prep_time": "15 mins",
        "cook_time": "4 hrs 15 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_indian": 1 
    },
    {
        "title": "Mexican Wedding Cookies",
        "image_url": "/static/images/mexican-wedding-cookies.png",
        "ingredients": [
            "1 cup unsalted butter, softened",
            "½ cup white sugar",
            "2 tsps vanilla extract",
            "2 tsps water",
            "2 cups all-purpose flour",
            "1 cup finely chopped almonds",
            "¼ tsp salt",
            "½ cup powdered sugar, or more as needed"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Beat butter and sugar in a medium bowl with an electric mixer until light and fluffy. Mix in vanilla and water.",
            "Add flour, almonds, and salt. Beat on low speed until dough is just combined. Cover and chill for 1 to 3 hours.",
            "Preheat the oven to 325°F (165°C). Shape chilled dough into 1-inch balls.",
            "Place dough balls 2 inches apart onto unlined cookie sheets.",
            "Bake in the preheated oven for 15 to 20 minutes. Remove cookies from the sheets and transfer to wire racks to cool, 20 to 30 minutes.",
            "Place powdered sugar in a shallow bowl. Roll cooled cookies in powdered sugar to coat.",
            "Transfer to an airtight container and store at room temperature."
        ],
        "serving_size": "36",
        "prep_time": "20 mins (plus chill time)",
        "cook_time": "15 mins",
        "is_snack": 1,
        "is_dessert": 1,
        "is_mexican": 1 
    },
    {
        "title": "Mediterranean Tilapia",
        "image_url": "/static/images/mediterranean-tilapia.png",
        "ingredients": [
            "2 tilapia fillets",
            "1 tbsp oil from the jar of sun-dried tomatoes",
            "1 tbsp lemon juice",
            "3 tbsps sun-dried tomatoes packed in oil, drained and chopped",
            "2 tbsps kalamata olives, pitted and chopped",
            "1 tbsp capers, drained"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Preheat the oven to 375°F (190°C).",
            "Place tilapia fillets in a baking dish; drizzle with oil and lemon juice.",
            "Bake in the preheated oven until fish flakes easily with a fork, 10 to 15 minutes; don't overcook.",
            "While the fish is cooking, mix sun-dried tomatoes, olives, and capers together.",
            "Serve tilapia with sun-dried tomato mixture over top."
        ],
        "serving_size": "2",
        "prep_time": "5 mins",
        "cook_time": "10 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_mediterranean": 1 
    },
    {
        "title": "Slow Cooker Beef and Vegetable Soup",
        "image_url": "/static/images/slow-cooker-beef-and-vegetable-soup.png",
        "ingredients": [
            "1 (32 fluid ounce) container beef broth, or more if needed",
            "3 carrots, cut into bite-size pieces",
            "1 large stalk celery, cut into bite-size pieces",
            "1 ½ tablespoons chopped fresh parsley",
            "½ teaspoon celery seed",
            "2 bay leaves",
            "1 pound lean ground beef",
            "1 onion, chopped",
            "1 clove garlic, minced, or to taste",
            "1 (14.5 ounce) can stewed tomatoes",
            "2 potatoes, peeled and cut into bite-size pieces",
            "1 (15.25 ounce) can whole kernel corn, drained",
            "1 (15 ounce) can green beans, drained",
            "1 (15 ounce) can peas, drained"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Stir the beef broth, carrots, celery, parsley, celery seed, and bay leaves into a slow cooker. Set slow cooker to High, cover, and cook until the vegetables are tender, about 2 hours.",
            "Place the ground beef, onion, and garlic into a skillet over medium heat. Cook, stirring frequently to break the beef into small pieces, until the onion is translucent and the beef is browned and no longer shows pink areas, 10 to 15 minutes.",
            "Drain off fat, and stir the stewed tomatoes into the beef mixture. Bring to a boil over medium heat, and cook, stirring frequently, until the tomatoes are broken up into small pieces.",
            "Stir the potatoes, corn, green beans, and peas into the soup in the slow cooker, and add the beef mixture. Stir everything together, cover, and set the slow cooker on High. Cook for 4 hours."
        ],
        "serving_size": "6",
        "prep_time": "15 mins",
        "cook_time": "6 hrs",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_appetizer": 1,
        "is_entree": 1,
        "is_sidedish": 1,
        "is_american": 1 
    },
    {
        "title": "Sweet and Sour Pork",
        "image_url": "/static/images/sweet-and-sour-pork.png",
        "ingredients": [
            "1 pound pork butt, cut into 1 inch cubes",
            "1 teaspoon soy sauce",
            "1 teaspoon salt",
            "¼ teaspoon white sugar",
            "1 egg white",
            "2 green onions, chopped",
            "1 quart vegetable oil for frying",
            "½ cup cornstarch",
            "1 tablespoon vegetable oil",
            "3 stalks celery, cut into 1/2 inch pieces",
            "1 medium green bell pepper, cut into 1 inch pieces",
            "1 medium onion, cut into wedges",
            "1 pinch white sugar, or to taste",
            "Salt to taste",
            "1 ¼ cups water, divided",
            "¾ cup white sugar",
            "⅓ cup apple cider vinegar",
            "¼ cup ketchup",
            "½ teaspoon soy sauce",
            "¼ teaspoon salt",
            "1 (8 ounce) can pineapple chunks, undrained",
            "2 tablespoons cornstarch"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Place cubed pork in a medium bowl and season with soy sauce, salt, and sugar for marinade.",
            "Add egg white and green onions and mix until well-combined. Cover and place in the refrigerator for at least 1 hour.",
            "Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer. Coat pork with cornstarch.",
            "Fry in hot oil until evenly browned, about 10 minutes. Drain on paper towels and set aside.",
            "Heat oil for vegetables in a wok over medium heat. Stir in celery, bell pepper, and onion; cook until tender, about 5 minutes. Season with pinch of sugar and salt. Remove from heat and set aside.",
            "Mix 1 cup water, 3/4 cup sugar, apple cider vinegar, ketchup, soy sauce, and salt in a large saucepan; bring to a boil over high heat.",
            "Stir in cooked pork, celery mixture, and pineapple chunks with juice.",
            "Return to a boil, then mix in remaining 1/4 cup water and cornstarch. Cook until thickened and warmed through, about 2 minutes."
        ],
        "serving_size": "4",
        "prep_time": "30 mins",
        "cook_time": "30 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_chinese": 1 
    },
    {
        "title": "Tuscan Butter Shrimp",
        "image_url": "/static/images/tuscan-butter-shrimp.png",
        "ingredients": [
            "1 pound peeled, deveined large raw shrimp, patted dry",
            "1 teaspoon kosher salt",
            "½ teaspoon freshly ground black pepper",
            "2 tablespoons unsalted butter, divided",
            "2 tablespoons oil from jar of oil-packed sun-dried tomatoes, divided",
            "1 ½ cups cherry tomatoes, halved",
            "½ cup thinly sliced shallot",
            "3 garlic cloves, thinly sliced",
            "½ cup drained and finely chopped sun-dried tomatoes in oil",
            "1 cup packed fresh baby spinach",
            "½ cup loosely packed fresh basil leaves, sliced, plus more for garnish",
            "½ cup dry white wine",
            "1 teaspoon grated lemon zest",
            "¼ teaspoon crushed red pepper",
            "1 cup heavy cream",
            "2 ounces Parmesan cheese, grated, plus more for garnish",
            "1 teaspoon fresh lemon juice"
        ],
        "optional_ingredients": [
            "-"
        ],
        "instructions": [
            "Toss shrimp with salt and pepper in a large bowl until well combined. Heat a large high-sided skillet over medium heat. Add 1 tablespoon butter and 1 tablespoon sun-dried tomato oil; heat until shimmering, about 2 minutes. Add shrimp in an even layer, and cook until opaque and pink, 3 to 4 minutes, flipping shrimp halfway through cooking time. Transfer shrimp to a large plate.",
            "Melt remaining 1 tablespoon butter with remaining 1 tablespoon sun-dried tomato oil in the same skillet; stir in cherry tomatoes, shallot, garlic, and sun-dried tomatoes. Cook, stirring occasionally, until tomatoes are soft and shallot is translucent, about 4 minutes.",
            "Stir spinach, basil, wine, lemon zest, and crushed red pepper into mixture in skillet; cook over medium, scraping up any browned bits from bottom of skillet, until wine mixture is reduced by half, about 2 minutes. Stir in heavy cream. Reduce heat to low, and add Parmesan cheese; cook, stirring constantly, until mixture is slightly thickened and simmering, about 2 minutes. Remove from heat.",
            "Stir in lemon juice; add cooked shrimp along with any juices from plate. Garnish with additional basil and Parmesan cheese."
        ],
        "serving_size": "4",
        "prep_time": "15 mins",
        "cook_time": "15 mins",
        "is_lunch": 1,
        "is_dinner": 1,
        "is_entree": 1,
        "is_italian": 1
    }
]